---
kind: property
id: P:Autodesk.Revit.DB.Dimension.Suffix
zh: 尺寸标注、标注
source: html/e8817946-d9c0-9f75-ca44-c7d379caa388.htm
---
# Autodesk.Revit.DB.Dimension.Suffix Property

**中文**: 尺寸标注、标注

The text shown after the segment's value.

## Syntax (C#)
```csharp
public string Suffix { get; set; }
```

## Remarks
This property is for use with single-segmment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.